Команда git add
добавляет содержимое рабочего каталога 
в индекс (staging area) для последующего коммита. Эта команда дается после добавления
файлов. Писать название целиком не обязательно: терминал дозаполнит данные автоматически.

Команда git commit
зафиксировать или сохранить
По умолчанию git commit использует лишь этот индекс, так что вы можете использовать git add 
для сборки слепка вашего следующего коммита.
Команда git commit берёт все данные, добавленные в индекс с помощью git add, и сохраняет их
слепок во внутренней базе данных, а затем сдвигает указатель текущей ветки на этот слепок

Команда git log Команда git checkout
Журнал изменений
Перед переключением версии файла в Git
используйте команду git log, чтобы увидеть
количество сохранений

Команда git checkout
Переключение между версиями.
Для работы нужно указать не только
интересующий вас коммит, но и вернуться 
в тот, где работаем, при помощи команды 
git checkout master.

Команда git diff
Показывает разницу между текущим файлом
и сохранённым
Перед переключением версии файла в Git
используйте команду git log, чтобы увидеть
количество сохранений
